tOblig-1/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.001;

vertices
(
    (0      50.0    0)      //Back
    (0      100.0   0)
    (200.0  0       0)
    (200.0  50.0    0)
    (200.0  100.0   0)
    (800.0  0       0)
    (800.0  50.0    0)
    (800.0  100.0   0)
    (1000.0 50.0    0)
    (1000.0 100.0   0)
    
    (0      50.0    1)      //Front
    (0      100.0   1)
    (200.0  0       1)
    (200.0  50.0    1)
    (200.0  100.0   1)
    (800.0  0       1)
    (800.0  50.0    1)
    (800.0  100.0   1)
    (1000.0 50.0    1)
    (1000.0 100.0   1)
);

blocks
(
    hex (0 3 4 1  10 13 14 11) (20 20 1) simpleGrading (1 1 1)
    hex (3 6 7 4  13 16 17 14) (20 20 1) simpleGrading (1 1 1)
    hex (2 5 6 3  12 15 16 13) (20 20 1) simpleGrading (1 1 1)
    hex (6 8 9 7  16 18 19 17) (20 20 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 10 11 1)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (8 9 19 18)
        );
    }
    walls
    {
        type wall;
        faces
        (
            (1 11 14 4)
            (4 14 17 7)
            (7 17 19 9)
            (0 3 13 10)
            (2 12 13 3)
            (2 5 15 12)
            (5 6 16 15)
            (6 8 18 16)
        );
        
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 1 4 3)
            (3 4 7 6)
            (6 7 9 8)
            (2 3 6 5)
            (10 13 14 11)
            (13 16 17 14)
            (16 18 19 17)
            (12 15 16 13)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
